In [1]:
import pandas as pd

dados = {
    'Crossfox': {'km': 35000, 'ano': 2005}, 
    'DS5': {'km': 17000, 'ano': 2015}, 
    'Fusca': {'km': 130000, 'ano': 1979}, 
    'Jetta': {'km': 56000, 'ano': 2011}, 
    'Passat': {'km': 62000, 'ano': 1999}
}

def km_media(dataset, ano_atual):
    result = {}
    for item in dataset.items():
        media = item[1]['km'] / (ano_atual - item[1]['ano'])
        item[1].update({ 'km_media': media })
        result.update({ item[0]: item[1] })

    return result

carros = pd.DataFrame(km_media(dados, 2019)).T
carros

                km     ano  km_media
Crossfox   35000.0  2005.0    2500.0
DS5        17000.0  2015.0    4250.0
Fusca     130000.0  1979.0    3250.0
Jetta      56000.0  2011.0    7000.0
Passat     62000.0  1999.0    3100.0

In [77]:
data = {
    "cor": ["azul", "laranja", "preto"],
    "preço": [5000, 15000, 15000],
    "carro": ['escort', 'civic', 'ka'],
    "ano de fabricação": [1998, 2005, 2008]
}

df = pd.DataFrame(data=data)
df = df.set_index("carro")
display(df)

            cor  preço  ano de fabricação
carro
escort     azul   5000               1998
civic   laranja  15000               2005
ka        preto  15000               2008

In [68]:
dt= {'Crossfox': {'km': 35000, 'ano': 2005, 'km_media': 2500.0},
 'DS5': {'km': 17000, 'ano': 2015, 'km_media': 4250.0},
 'Fusca': {'km': 130000, 'ano': 1979, 'km_media': 3250.0},
 'Jetta': {'km': 56000, 'ano': 2011, 'km_media': 7000.0},
 'Passat': {'km': 62000, 'ano': 1999, 'km_media': 3100.0}}

df1 = pd.DataFrame(data=dt).T

df1

                km     ano  km_media
Crossfox   35000.0  2005.0    2500.0
DS5        17000.0  2015.0    4250.0
Fusca     130000.0  1979.0    3250.0
Jetta      56000.0  2011.0    7000.0
Passat     62000.0  1999.0    3100.0

In [83]:
import pandas as pd
with open ('Python_Data_Science\Pandas\data\db.csv', 'rb') as file:
    ds = pd.read_csv(file, sep=';', index_col=0, header=0)


display(ds)

,Motor,Ano,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,,,
Jetta Variant,Motor 4.0 Turbo,2003,44410.0,False,"['Rodas de liga', 'Travas elétricas', 'Piloto ...",88078.64
Passat,Motor Diesel,1991,5712.0,False,"['Central multimídia', 'Teto panorâmico', 'Fre...",106161.94
Crossfox,Motor Diesel V8,1990,37123.0,False,"['Piloto automático', 'Controle de estabilidad...",72832.16
DS5,Motor 2.4 Turbo,2019,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07
Aston Martin DB4,Motor 2.4 Turbo,2006,25757.0,False,"['Rodas de liga', '4 X 4', 'Central multimídia...",92612.10
...,...,...,...,...,...,...
Phantom 2013,Motor V8,2014,27505.0,False,"['Controle de estabilidade', 'Piloto automátic...",51759.58
Cadillac Ciel concept,Motor V8,1991,29981.0,False,"['Bancos de couro', 'Painel digital', 'Sensor ...",51667.06
Classe GLK,Motor 5.0 V8 Bi-Turbo,2002,52637.0,False,"['Rodas de liga', 'Controle de tração', 'Câmbi...",68934.03
Aston Martin DB5,Motor Diesel,1996,7685.0,False,"['Ar condicionado', '4 X 4', 'Câmbio automátic...",122110.90
Macan,Motor Diesel V6,1992,50188.0,False,"['Central multimídia', 'Teto panorâmico', 'Vid...",90381.47

In [63]:
#Diferença na definição de Series e DataFrames

#Recuperando dados do dataframe em forma de Series.
ds["Valor"]

Nome
Jetta Variant             88078.64
Passat                   106161.94
Crossfox                  72832.16
DS5                      124549.07
Aston Martin DB4          92612.10
                           ...
Phantom 2013              51759.58
Cadillac Ciel concept     51667.06
Classe GLK                68934.03
Aston Martin DB5         122110.90
Macan                     90381.47
Name: Valor, Length: 258, dtype: float64

In [79]:
#Recuperando dados do dataframe em forma de DataFrame.
ds[["Valor"]]

                           Valor
Nome
Jetta Variant           88078.64
Passat                 106161.94
Crossfox                72832.16
DS5                    124549.07
Aston Martin DB4        92612.10
...                          ...
Phantom 2013            51759.58
Cadillac Ciel concept   51667.06
Classe GLK              68934.03
Aston Martin DB5       122110.90
Macan                   90381.47

[258 rows x 1 columns]

In [85]:
#Utilizando a função loc[] para visualizar todas as linhas e apenas os campos 'Valor' e 'Quilometragem'.

ds.loc[:, ["Valor", "Quilometragem"]]

                           Valor  Quilometragem
Nome
Jetta Variant           88078.64        44410.0
Passat                 106161.94         5712.0
Crossfox                72832.16        37123.0
DS5                    124549.07            NaN
Aston Martin DB4        92612.10        25757.0
...                          ...            ...
Phantom 2013            51759.58        27505.0
Cadillac Ciel concept   51667.06        29981.0
Classe GLK              68934.03        52637.0
Aston Martin DB5       122110.90         7685.0
Macan                   90381.47        50188.0

[258 rows x 2 columns]

In [92]:
#Utilizando a função loc[] para fatiar linhas.

ds.loc['Passat':"Aston Martin DB4"]

,Motor,Ano,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,,,
Passat,Motor Diesel,1991,5712.0,False,"['Central multimídia', 'Teto panorâmico', 'Fre...",106161.94
Crossfox,Motor Diesel V8,1990,37123.0,False,"['Piloto automático', 'Controle de estabilidad...",72832.16
DS5,Motor 2.4 Turbo,2019,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07
Aston Martin DB4,Motor 2.4 Turbo,2006,25757.0,False,"['Rodas de liga', '4 X 4', 'Central multimídia...",92612.10

In [96]:
#   Utilizando a função loc[] para fatiar linhas e reorganizar colunas (ou selecionar apenas um conjunto).
#   Apenas é necessário passar as colunas desejadas como um outro argumento
ds.loc['Passat':"Aston Martin DB4", ["Motor", "Valor", 'Acessórios', ]]

,Motor,Valor,Acessórios
Nome,,,
Passat,Motor Diesel,106161.94,"['Central multimídia', 'Teto panorâmico', 'Fre..."
Crossfox,Motor Diesel V8,72832.16,"['Piloto automático', 'Controle de estabilidad..."
DS5,Motor 2.4 Turbo,124549.07,"['Travas elétricas', '4 X 4', 'Vidros elétrico..."
Aston Martin DB4,Motor 2.4 Turbo,92612.10,"['Rodas de liga', '4 X 4', 'Central multimídia..."

In [108]:
#utilizando .iloc[] para executar o mesmo fatiamento anterior, a função busca as linhas usando seu index numérico.

ds.iloc[1:5]

Nome
Passat              106161.94
Crossfox             72832.16
DS5                 124549.07
Aston Martin DB4     92612.10
Name: Valor, dtype: float64

In [113]:
#utilizando .iloc[] para executar o mesmo fatiamento anterior, buscando e reoganizando as colunas pelo seu index.

ds.iloc[1:5,[0, 5, 4]]

,Motor,Valor,Acessórios
Nome,,,
Passat,Motor Diesel,106161.94,"['Central multimídia', 'Teto panorâmico', 'Fre..."
Crossfox,Motor Diesel V8,72832.16,"['Piloto automático', 'Controle de estabilidad..."
DS5,Motor 2.4 Turbo,124549.07,"['Travas elétricas', '4 X 4', 'Vidros elétrico..."
Aston Martin DB4,Motor 2.4 Turbo,92612.10,"['Rodas de liga', '4 X 4', 'Central multimídia..."

In [118]:
#   É possível encadear os métodos iloc[] e loc[] para buscar linhas por index, colunas pelo nome ou vice-versa.

ds.iloc[1:8].loc[:, ["Motor", "Valor", "Acessórios"]]

,Motor,Valor,Acessórios
Nome,,,
Passat,Motor Diesel,106161.94,"['Central multimídia', 'Teto panorâmico', 'Fre..."
Crossfox,Motor Diesel V8,72832.16,"['Piloto automático', 'Controle de estabilidad..."
DS5,Motor 2.4 Turbo,124549.07,"['Travas elétricas', '4 X 4', 'Vidros elétrico..."
Aston Martin DB4,Motor 2.4 Turbo,92612.10,"['Rodas de liga', '4 X 4', 'Central multimídia..."
Palio Weekend,Motor 1.8 16v,97497.73,"['Sensor de estacionamento', 'Teto panorâmico'..."
A5,Motor 4.0 Turbo,56445.20,"['Câmbio automático', 'Câmera de estacionament..."
Série 3 Cabrio,Motor 1.0 8v,112310.44,"['Controle de estabilidade', 'Sensor crepuscul..."

In [125]:
#   Também podemos fazer a mesma seleção anterior de apenas um dado em
#   formato de Series e transformá-la em Dataframe utilizando .to_frame()

display(ds.iloc[1:8].loc[:, "Valor"], ds.iloc[1:8].loc[:, "Valor"].to_frame())

Nome
Passat              106161.94
Crossfox             72832.16
DS5                 124549.07
Aston Martin DB4     92612.10
Palio Weekend        97497.73
A5                   56445.20
Série 3 Cabrio      112310.44
Name: Valor, dtype: float64

                      Valor
Nome
Passat            106161.94
Crossfox           72832.16
DS5               124549.07
Aston Martin DB4   92612.10
Palio Weekend      97497.73
A5                 56445.20
Série 3 Cabrio    112310.44

In [161]:
#   Iterando dataframes:
#   isso não é funcional, pois apenas retorna as colunas.
for item in ds[:10]:
    print(item)

Motor
Ano
Quilometragem
Zero_km
Acessórios
Valor

In [166]:
#   Visto que a função .iterrows() é uma função geradora, ela cria um iterador 
#   a partir das linhas do dataframe, conforme mostrado no display abaixo

display(ds[:5].iterrows())

#   Portanto, o seguinte é uma maneira válida de iterar as linhas,
#   no caso do dataset não possuir um volume muito grande de dados:

display(list(ds[:5].iterrows()))

[('Jetta Variant',
  Motor                                              Motor 4.0 Turbo
  Ano                                                           2003
  Quilometragem                                              44410.0
  Zero_km                                                      False
  Acessórios       ['Rodas de liga', 'Travas elétricas', 'Piloto ...
  Valor                                                     88078.64
  Name: Jetta Variant, dtype: object),
 ('Passat',
  Motor                                                 Motor Diesel
  Ano                                                           1991
  Quilometragem                                               5712.0
  Zero_km                                                      False
  Acessórios       ['Central multimídia', 'Teto panorâmico', 'Fre...
  Valor                                                    106161.94
  Name: Passat, dtype: object),
 ('Crossfox',
  Motor                                              Motor Diesel V8
  Ano                                                           1990
  Quilometragem                                              37123.0
  Zero_km                                                      False
  Acessórios       ['Piloto automático', 'Controle de estabilidad...
  Valor                                                     72832.16
  Name: Crossfox, dtype: object),
 ('DS5',
  Motor                                              Motor 2.4 Turbo
  Ano                                                           2019
  Quilometragem                                                  NaN
  Zero_km                                                       True
  Acessórios       ['Travas elétricas', '4 X 4', 'Vidros elétrico...
  Valor                                                    124549.07
  Name: DS5, dtype: object),
 ('Aston Martin DB4',
  Motor                                              Motor 2.4 Turbo
  Ano                                                           2006
  Quilometragem                                              25757.0
  Zero_km                                                      False
  Acessórios       ['Rodas de liga', '4 X 4', 'Central multimídia...
  Valor                                                      92612.1
  Name: Aston Martin DB4, dtype: object)]

In [160]:
#   A idéia das células abaixo é a mesma só que de maneiras diferentes
#   A forma abaixo usa diretamente o operador de indexação (colchetes) 
#   e itera linha por linha buscando pelos dados das colunas abaixo.

for item in ds[:4][["Valor", "Motor", ]].iterrows():
    display(item)

('Jetta Variant',
 Valor           88078.64
 Motor    Motor 4.0 Turbo
 Name: Jetta Variant, dtype: object)

('Passat',
 Valor       106161.94
 Motor    Motor Diesel
 Name: Passat, dtype: object)

('Crossfox',
 Valor           72832.16
 Motor    Motor Diesel V8
 Name: Crossfox, dtype: object)

('DS5',
 Valor          124549.07
 Motor    Motor 2.4 Turbo
 Name: DS5, dtype: object)

In [159]:
#   Esta forma também itera linha por linha porém utiliza iloc, seguido de .loc
#   para executar o fatiamento e então executar a iteração.

for item in ds.iloc[:4].loc[:,["Valor", "Motor", ]].iterrows():
    display(item)

('Jetta Variant',
 Valor           88078.64
 Motor    Motor 4.0 Turbo
 Name: Jetta Variant, dtype: object)

('Passat',
 Valor       106161.94
 Motor    Motor Diesel
 Name: Passat, dtype: object)

('Crossfox',
 Valor           72832.16
 Motor    Motor Diesel V8
 Name: Crossfox, dtype: object)

('DS5',
 Valor          124549.07
 Motor    Motor 2.4 Turbo
 Name: DS5, dtype: object)

In [199]:
#   A função .iterrows() gera um iterador que contém tuplas, compostas do index do 
#   dataset e as informações das linhas(rows), portanto é possível atribuir os dados 
#   desempacotando e até criando campos novos, desta maneira:

ANO_ATUAL = 2021
is_number= lambda x: type(x) == int or float

for indice, linha in ds.iterrows():
    idade_carro = ANO_ATUAL - linha['Ano']
    km = linha['Quilometragem']
    ds.loc[indice, "km_media"] = km / idade_carro if idade_carro != 0 and is_number(km) else 0
    

display(ds[:15])

,Motor,Ano,Quilometragem,Zero_km,Acessórios,Valor,km_media
Nome,,,,,,,
Jetta Variant,Motor 4.0 Turbo,2003,44410.0,False,"['Rodas de liga', 'Travas elétricas', 'Piloto ...",88078.64,2467.222222
Passat,Motor Diesel,1991,5712.0,False,"['Central multimídia', 'Teto panorâmico', 'Fre...",106161.94,190.400000
Crossfox,Motor Diesel V8,1990,37123.0,False,"['Piloto automático', 'Controle de estabilidad...",72832.16,1197.516129
DS5,Motor 2.4 Turbo,2019,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07,NaN
Aston Martin DB4,Motor 2.4 Turbo,2006,25757.0,False,"['Rodas de liga', '4 X 4', 'Central multimídia...",92612.10,1717.133333
Palio Weekend,Motor 1.8 16v,2012,10728.0,False,"['Sensor de estacionamento', 'Teto panorâmico'...",97497.73,1192.000000
A5,Motor 4.0 Turbo,2019,NaN,True,"['Câmbio automático', 'Câmera de estacionament...",56445.20,NaN
Série 3 Cabrio,Motor 1.0 8v,2009,77599.0,False,"['Controle de estabilidade', 'Sensor crepuscul...",112310.44,6466.583333
Dodge Jorney,Motor 3.0 32v,2010,99197.0,False,"['Vidros elétricos', 'Piloto automático', 'Tet...",120716.27,9017.909091
Carens,Motor 5.0 V8 Bi-Turbo,2011,37978.0,False,"['Ar condicionado', 'Painel digital', 'Central...",76566.49,3797.800000
Ford Edge,Motor Diesel V6,2002,12859.0,False,"['Sensor crepuscular', 'Rodas de liga', 'Teto ...",71647.59,676.789474
Courier,Motor Diesel V8,2007,8052.0,False,"['Central multimídia', '4 X 4', 'Piloto automá...",73919.53,575.142857
S-18,Motor V6,2001,89773.0,False,"['Bancos de couro', 'Sensor de chuva', 'Rodas ...",112732.99,4488.650000
J5,Motor V6,2019,NaN,True,"['Sensor crepuscular', 'Painel digital', 'Roda...",53183.38,NaN
F-Type Coupé,Motor 5.0 V8 Bi-Turbo,2009,41457.0,False,"['Piloto automático', 'Sensor crepuscular', 'S...",127488.42,3454.750000

In [7]:
dia = [2,9,13,15,18]
mais_dias = [22,25,27,30]
dia.extend(mais_dias)
dia

[2, 9, 13, 15, 18, 22, 25, 27, 30]